Certification/src/Documents/ЭлектронноеПисьмоИсходящее/ЭлектронноеПисьмоИсходящее.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЭлектронноеПисьмоИсходящее</name>
  <basedOn>Document.ТелефонныйЗвонок</basedOn>
  <basedOn>Document.КомментарийПользователя</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнутреннийЗаголовок</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <type>
      <types>EnumRef.ВариантыВажностиВзаимодействия</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнутренняяПереписка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьВложения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторНаСервере</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОснования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСообщенияОтправкаIMAP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторыОснований</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Кодировка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправительПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеОшибкиПриОтправке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_Рассмотрено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_РассмотретьПосле</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПредмет</name>
    <type>
      <types>DefinedType.ПредметВзаимодействия</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправленоСОшибкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СписокПолучателейКопий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписокПолучателейПисьма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписокПолучателейСкрытыхКопий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПисьма</name>
    <type>
      <types>EnumRef.СтатусыИсходящегоЭлектронногоПисьма</types>
    </type>
  </attributes>
  <attributes>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстHTML</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипТекста</name>
    <type>
      <types>EnumRef.ТипыТекстовЭлектронныхПисем</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВзаимодействиеОснование</name>
    <type>
      <types>DocumentRef.ЭлектронноеПисьмоИсходящее</types>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
      <types>DocumentRef.ТелефонныйЗвонок</types>
    </type>
  </attributes>
  <attributes>
    <name>УведомитьОДоставке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УведомитьОПрочтении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьТелоИсходногоПисьма</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьТелоИсходногоПисьма</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалятьПослеОтправки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКогдаОтправить</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАктуальностиОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьИдентификаторСообщенияОтправкаIMAP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПолучателиПисьма</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>DefinedType.КонтактВзаимодействия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиКопий</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>DefinedType.КонтактВзаимодействия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиОтвета</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>DefinedType.КонтактВзаимодействия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиСкрытыхКопий</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>DefinedType.КонтактВзаимодействия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаборыЗначенийДоступа</name>
    <attributes>
      <name>НомерНабора</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеДоступа</name>
      <comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</comment>
      <type>
        <types>DefinedType.ЗначениеДоступа</types>
      </type>
    </attributes>
    <attributes>
      <name>Уточнение</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>Чтение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Изменение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НепринятыеВложения</name>
    <attributes>
      <name>ИмяВложение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПисьмаВложения</name>
    <attributes>
      <name>Письмо</name>
      <type>
        <types>DocumentRef.ЭлектронноеПисьмоИсходящее</types>
        <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядковыйНомерВоВложениях</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Certification/src/Catalogs/ПользователиСервисов/ПользователиСервисов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПользователиСервисов</name>
  <owners>Catalog.Сервисы</owners>
  <attributes>
    <name>ЧасовойПояс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаEmail</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>GUIDОБД</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Эталон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Certification/src/CommonModules/КонтактнаяИнформацияУСП/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает первое значение пользователя сервиса по адресу электронной почты.
//
// Параметры:
//  Сервис - СправочникСсылка.Сервисы - сервис пользователя.
//  Адрес  - Строка - адрес электронной почты пользователя.
// 
// Возвращаемое значение:
//  СправочникСсылка.ПользователиСервисов - пользователь сервиса.
//
Функция ПользовательСервисаПоАдресу(Сервис, Адрес) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ПользователиСервисовКонтактнаяИнформация.Ссылка КАК ПользовательСервиса
		|ИЗ
		|	Справочник.ПользователиСервисов.КонтактнаяИнформация КАК ПользователиСервисовКонтактнаяИнформация
		|ГДЕ
		|	ПользователиСервисовКонтактнаяИнформация.Представление = &Адрес
		|	И ПользователиСервисовКонтактнаяИнформация.Тип = &ТипКИ
		|	И ПользователиСервисовКонтактнаяИнформация.Ссылка.Владелец = &Сервис";
		
	Запрос.УстановитьПараметр("Адрес", Адрес);
	Запрос.УстановитьПараметр("ТипКИ", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	Запрос.УстановитьПараметр("Сервис", Сервис);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ПользовательСервиса;
	Иначе
		Возврат Справочники.ПользователиСервисов.ПустаяСсылка();
	КонецЕсли; 
	
КонецФункции

// Возвращает актуальные адреса отправки пользователя сервиса.
//
// Параметры:
//  ПользовательСервиса - СправочникСсылка.ПользователиСервисов - пользователь сервиса.
// 
// Возвращаемое значение:
//  Массив - электронные адреса объекта, с которых приходили последние сообщения.
//
Функция АктуальныеАдресаОтправкиПользователяСервиса(ПользовательСервиса) Экспорт
	
	АдресаПользователя = ВсеЭлектронныеАдресаПользователяСервиса(ПользовательСервиса);
	ДоступныеАдреса = Новый Массив;
	Для каждого Элемент Из АдресаПользователя Цикл
		ДоступныеАдреса.Добавить(Элемент.Адрес);
	КонецЦикла; 
	
	Если ДоступныеАдреса.Количество() = 0 Тогда
		Возврат АдресаПользователя;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 10
        |   Получатели.Контакт,
        |   Получатели.Представление,
        |   Получатели.Адрес,
        |   Получатели.Ссылка.ДатаОтправления КАК ДатаОтправления,
        |   Получатели.Ссылка КАК Ссылка
        |ИЗ
        |   Документ.ЭлектронноеПисьмоИсходящее.ПолучателиПисьма КАК Получатели
        |ГДЕ
        |   Получатели.Контакт = &ПользовательСервиса
        |   И НЕ Получатели.Ссылка.ПометкаУдаления
        |   И Получатели.Ссылка.СтатусПисьма = &СтатусОтправлено
        |   И Получатели.Адрес В(&ДоступныеАдреса)
        |
        |УПОРЯДОЧИТЬ ПО
        |   ДатаОтправления УБЫВ
        |ИТОГИ ПО
        |   Ссылка";
	
	Запрос.УстановитьПараметр("ПользовательСервиса", ПользовательСервиса);
	Запрос.УстановитьПараметр("СтатусОтправлено", Перечисления.СтатусыИсходящегоЭлектронногоПисьма.Отправлено);
	Запрос.УстановитьПараметр("ДоступныеАдреса", ДоступныеАдреса);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Адреса = Новый Массив;
	Пока Выборка.Следующий() Цикл
		ВыборкаПолучатель = Выборка.Выбрать();
		Пока ВыборкаПолучатель.Следующий() Цикл
			ДанныеКонтакта = Новый Структура;
			ДанныеКонтакта.Вставить("Адрес", ВыборкаПолучатель.Адрес); 
			ДанныеКонтакта.Вставить("Представление", ВыборкаПолучатель.Представление);
			ДанныеКонтакта.Вставить("Контакт", ВыборкаПолучатель.Контакт); 
			Адреса.Добавить(ДанныеКонтакта);
		КонецЦикла; 
		Прервать;
	КонецЦикла;
	 
	Если Адреса.Количество() = 0 Тогда
		Возврат АдресаПользователя;
	Иначе
		Возврат Адреса;
	КонецЕсли;
	
КонецФункции

// Функция - Все электронные адреса пользователя сервиса
//
// Параметры:
//  ПользовательСервиса - СправочникСсылка.ПользователиСервисов - пользователь сервиса.
// 
// Возвращаемое значение:
//  Массив - электронные адреса объекта.
//
Функция ВсеЭлектронныеАдресаПользователяСервиса(ПользовательСервиса) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПользователиСервисовКонтактнаяИнформация.Представление КАК Адрес,
		|	ПользователиСервисовКонтактнаяИнформация.Ссылка КАК Контакт,
		|	ПользователиСервисовКонтактнаяИнформация.Ссылка.Наименование КАК ПредставлениеКонтакта
		|ИЗ
		|	Справочник.ПользователиСервисов.КонтактнаяИнформация КАК ПользователиСервисовКонтактнаяИнформация
		|ГДЕ
		|	ПользователиСервисовКонтактнаяИнформация.Ссылка = &ПользовательСервиса
		|	И ПользователиСервисовКонтактнаяИнформация.Вид В(&ВидыКИПочты)";
	
	ВидыКИПочты = Новый Массив;
	ВидыКИПочты.Добавить(Справочники.ВидыКонтактнойИнформации.EmailПользователяСервиса);
	ВидыКИПочты.Добавить(Справочники.ВидыКонтактнойИнформации.ДополнительныйEmailПользователяСервиса);
	
	Запрос.УстановитьПараметр("ВидыКИПочты", ВидыКИПочты);
	Запрос.УстановитьПараметр("ПользовательСервиса", ПользовательСервиса);
	Результат = Запрос.Выполнить();
	Адреса = Новый Массив;
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ДанныеКонтакта = Новый Структура;
		ДанныеКонтакта.Вставить("Адрес", Выборка.Адрес); 
		ДанныеКонтакта.Вставить("Представление", СтрШаблон("%1 <%2>", Выборка.ПредставлениеКонтакта, Выборка.Адрес));
		ДанныеКонтакта.Вставить("Контакт", Выборка.Контакт); 
		Адреса.Добавить(ДанныеКонтакта);
	КонецЦикла; 
	
	Возврат Адреса;
	
КонецФункции

// Функция - Все электронные адреса абонента
//
// Параметры:
//  Абонент - СправочникСсылка.Абоненты - абонент.
// 
// Возвращаемое значение:
//  Массив - электронные адреса объекта.
//
Функция ВсеЭлектронныеАдресаАбонента(Абонент) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	АбонентыКонтактнаяИнформация.Представление КАК Адрес,
		|	АбонентыКонтактнаяИнформация.Ссылка КАК Контакт,
		|	АбонентыКонтактнаяИнформация.Ссылка.Наименование КАК ПредставлениеКонтакта
		|ИЗ
		|	Справочник.Абоненты.КонтактнаяИнформация КАК АбонентыКонтактнаяИнформация
		|ГДЕ
		|	АбонентыКонтактнаяИнформация.Ссылка = &Абонент
		|	И АбонентыКонтактнаяИнформация.Вид В(&ВидыКИПочты)";
	
	ВидыКИПочты = Новый Массив;
	ВидыКИПочты.Добавить(Справочники.ВидыКонтактнойИнформации.EmailАбонента);
	ВидыКИПочты.Добавить(Справочники.ВидыКонтактнойИнформации.ДополнительныйEmailАбонента);
	
	Запрос.УстановитьПараметр("ВидыКИПочты", ВидыКИПочты);
	Запрос.УстановитьПараметр("Абонент", Абонент);
	Результат = Запрос.Выполнить();
	Адреса = Новый Массив;
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ДанныеКонтакта = Новый Структура;
		ДанныеКонтакта.Вставить("Адрес", Выборка.Адрес); 
		ДанныеКонтакта.Вставить("Представление", СтрШаблон("%1 <%2>", Выборка.ПредставлениеКонтакта, Выборка.Адрес));
		ДанныеКонтакта.Вставить("Контакт", Выборка.Контакт); 
		Адреса.Добавить(ДанныеКонтакта);
	КонецЦикла; 
	
	Возврат Адреса;
	
КонецФункции 

// Функция - Все электронные адреса пользователя
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи - пользователь.
// 
// Возвращаемое значение:
//  Массив - электронные адреса объекта.
//
Функция ВсеЭлектронныеАдресаПользователя(Пользователь) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КонтактнаяИнформация.Представление КАК Адрес,
		|	КонтактнаяИнформация.Ссылка КАК Контакт,
		|	КонтактнаяИнформация.Ссылка.Наименование КАК ПредставлениеКонтакта
		|ИЗ
		|	Справочник.Пользователи.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Ссылка = &Пользователь
		|	И КонтактнаяИнформация.Вид В(&ВидыКИПочты)";
	
	ВидыКИПочты = Новый Массив;
	ВидыКИПочты.Добавить(Справочники.ВидыКонтактнойИнформации.EmailПользователя);
	
	Запрос.УстановитьПараметр("ВидыКИПочты", ВидыКИПочты);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	Адреса = Новый Массив;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДанныеКонтакта = Новый Структура;
		ДанныеКонтакта.Вставить("Адрес", Выборка.Адрес); 
		ДанныеКонтакта.Вставить("Представление", СтрШаблон("%1 <%2>", Выборка.ПредставлениеКонтакта, Выборка.Адрес));
		ДанныеКонтакта.Вставить("Контакт", Выборка.Контакт); 
		Адреса.Добавить(ДанныеКонтакта);
	КонецЦикла; 
	
	Возврат Адреса;
	
КонецФункции

// Функция - Все электронные адреса линии поддержки
//
// Параметры:
//  ЛинияПоддержки - СправочникСсылка.ЛинииПоддержки - линия поддержки.
// 
// Возвращаемое значение:
//  Массив - электронные адреса объекта.
//
Функция ВсеЭлектронныеАдресаЛинииПоддержки(ЛинияПоддержки) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КонтактнаяИнформация.Представление КАК Адрес,
		|	КонтактнаяИнформация.Ссылка КАК Контакт,
		|	КонтактнаяИнформация.Ссылка.Наименование КАК ПредставлениеКонтакта
		|ИЗ
		|	Справочник.ЛинииПоддержки.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Ссылка = &ЛинияПоддержки
		|	И КонтактнаяИнформация.Вид В(&ВидыКИПочты)";
	
	ВидыКИПочты = Новый Массив;
	ВидыКИПочты.Добавить(Справочники.ВидыКонтактнойИнформации.EmailЛинииПоддержки);
	
	Запрос.УстановитьПараметр("ВидыКИПочты", ВидыКИПочты);
	Запрос.УстановитьПараметр("ЛинияПоддержки", ЛинияПоддержки);
	Результат = Запрос.Выполнить();
	Адреса = Новый Массив;
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ДанныеКонтакта = Новый Структура;
		ДанныеКонтакта.Вставить("Адрес", Выборка.Адрес); 
		ДанныеКонтакта.Вставить("Представление", СтрШаблон("%1 <%2>", Выборка.ПредставлениеКонтакта, Выборка.Адрес));
		ДанныеКонтакта.Вставить("Контакт", Выборка.Контакт); 
		Адреса.Добавить(ДанныеКонтакта);
	КонецЦикла; 
	
	Возврат Адреса;
	
КонецФункции

// Функция - Все электронные адреса объекта
//
// Параметры:
//  Объект - ЛюбаяСсылка - ссылка на объект, для которого нужно получить адреса.
// 
// Возвращаемое значение:
//  Массив - электронные адреса объекта.
//
Функция ВсеЭлектронныеАдресаОбъекта(Объект) Экспорт
	
	Если ТипЗнч(Объект) = Тип("СправочникСсылка.Абоненты") Тогда
		Возврат ВсеЭлектронныеАдресаАбонента(Объект);
	ИначеЕсли ТипЗнч(Объект) = Тип("СправочникСсылка.ПользователиСервисов") Тогда
		Возврат ВсеЭлектронныеАдресаПользователяСервиса(Объект);
	ИначеЕсли ТипЗнч(Объект) = Тип("СправочникСсылка.Пользователи") Тогда
		Возврат ВсеЭлектронныеАдресаПользователя(Объект);
	ИначеЕсли ТипЗнч(Объект) = Тип("СправочникСсылка.ЛинииПоддержки") Тогда
		Возврат ВсеЭлектронныеАдресаЛинииПоддержки(Объект);
	Иначе
		Возврат Новый Массив;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
